DataProcessors/СверкаПродажЛьготныхТоваровОплаченныхЭСФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СверкаПродажЛьготныхТоваровОплаченныхЭСФСС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадержкаМеждуОтправкойПакетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредельноеЧислоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСообщенияОбОшибкахЗагрузкиВОкноСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекОтбор</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроекОтчет</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДляФормированияОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧекСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторКорзины</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЭлектронногоСертификата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТРУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЧекиДляЗагрузкиДанныхИзНСПК</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧекСсылка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторКорзины</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторКассы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючКассы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПротоколОбмена</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПротоколОбменаФЭСНСПК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/СверкаПродажЛьготныхТоваровОплаченныхЭСФСС/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОплатаЭлектроннымиСертификатамиФСС = ПолучитьФункциональнуюОпцию("ОплатаЭлектроннымиСертификатамиФСС");
	
	Объект.ЗадержкаМеждуОтправкойПакетов = 1000;
	Объект.ПредельноеЧислоОшибок = 3;
	Объект.ВыводитьСообщенияОбОшибкахЗагрузкиВОкноСообщений = Истина;
	
	УстановитьКонтекстнуюПодсказкуДляКнопкиПроверки(Элементы.КнопкаНайтиЧекиДляЗагрузкиДанныхИзНСПКРасширеннаяПодсказка.Заголовок, Истина);

	// Важно: Отборы и Параметры данных в макетах должны совпадать.
	// Инициализируем настройки отчета из макета
	СхемаКомпоновкиОтбор = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетДанныеДляОбработки");	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СхемаКомпоновкиОтбор, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилища);

	Объект.КомпоновщикНастроекОтбор.Инициализировать(ИсточникНастроек);
	// Считаем, что вариант должен присутствовать всегда 
	ВариантОтчета = СхемаКомпоновкиОтбор.ВариантыНастроек.Найти("ДляЗагрузкиДанных");
	Объект.КомпоновщикНастроекОтбор.ЗагрузитьНастройки(ВариантОтчета.Настройки);

	// Инициализируем настройки отчета из макета
	СхемаКомпоновкиОтчет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетОтчета");	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СхемаКомпоновкиОтчет, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилища);
	
	Объект.КомпоновщикНастроекОтчет.Инициализировать(ИсточникНастроек);
	// Считаем, что вариант должен присутствовать всегда 
	ВариантОтчета = СхемаКомпоновкиОтчет.ВариантыНастроек.Найти("ОсновнойОтчет");
	Объект.КомпоновщикНастроекОтчет.ЗагрузитьНастройки(ВариантОтчета.Настройки);

	ВключитьРасширенныйРежимНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ОбъектПериод = Настройки["Объект.Период"];
	Если Не ОбъектПериод = Неопределено Тогда
		ПараметрПериод = Объект.КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.Элементы.Найти("Период");
		Если ПараметрПериод <> Неопределено Тогда
			ПараметрПериод.Использование = Истина;
			ПараметрПериод.Значение = ОбъектПериод;
		КонецЕсли;
	КонецЕсли;

	ОбъектОрганизация = Настройки["Объект.Организация"];
	Если Не ОбъектПериод = Неопределено Тогда
		ПараметрОрганизация = Объект.КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
		Если ПараметрОрганизация <> Неопределено Тогда
			ПараметрОрганизация.Использование = Истина;
			ПараметрОрганизация.Значение = ОбъектОрганизация;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПараметрПериод = Объект.КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.Элементы.Найти("Период");
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Использование = Истина;
		ПараметрПериод.Значение = Объект.Период;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПараметрОрганизация = Объект.КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	Если ПараметрОрганизация <> Неопределено Тогда
		ПараметрОрганизация.Использование = Истина;
		ПараметрОрганизация.Значение = Объект.Организация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьНеобходимостьЗагрузкиДанныхИзНСПК(Команда)
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЧекиДляЗагрузкиДанныхИзНСПКНаКлиенте(Объект.КомпоновщикНастроекОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзНСПК(Команда)
	ОчиститьСообщения();
	
	Если ОплатаЭлектроннымиСертификатамиФСС = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки данных нужно в настройках ""Продажи"" включить ФО ""Оплата электронными сертификатами (ФЗ-491)"" и настроить параметры подключения.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетПослеЗагрузкиДанных = Ложь;	
	ЗагрузитьДанныеИзНСПКНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОбИспользованииЭСФСС(Команда)
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчетПослеЗагрузкиДанных = Ложь;
	Если Элементы.ВключитьРасширенныйРежим.Пометка Тогда
		СформироватьОтчетОбИспользованииЭСФССНаКлиенте();
	Иначе
		
		Если ОплатаЭлектроннымиСертификатамиФСС = Ложь Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки данных нужно в настройках ""Продажи"" включить ФО ""Оплата электронными сертификатами (ФЗ-491)"" и настроить параметры подключения.'"));
			Возврат;
		КонецЕсли;

		ЗаполнитьЧекиДляЗагрузкиДанныхИзНСПКНаКлиенте(Объект.КомпоновщикНастроекОтбор);

		СформироватьОтчетПослеЗагрузкиДанных = Истина;
		ЗагрузитьДанныеИзНСПКНаКлиенте();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьЗагрузкуДанныхИзНСПК(Команда)

	ПрерватьВыполнениеЗагрузки = Истина;
	Элементы.КнопкаПрерватьЗагрузкуДанныхИзНСПК.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРасширенныйРежим(Команда)

	Элементы.ВключитьРасширенныйРежим.Пометка = Не Элементы.ВключитьРасширенныйРежим.Пометка;	
	ВключитьРасширенныйРежимНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеОтчета

&НаКлиенте
Процедура СформироватьОтчетОбИспользованииЭСФССНаКлиенте()
	
	Если Объект.ДанныеДляФормированияОтчета.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'По чекам нет загруженных данных из НСПК. Отчет можно собрать только в разрезе зарегистрированных чеков в базе.'"));
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьОтчетОбИспользованииЭСФССНаСервере();
	
	ТабличныйДокумент.Показать(НСтр("ru = 'Отчет по продажам льготных товаров с оплатой ЭС ФЗ-491'"));

КонецПроцедуры

&НаСервере
Функция СформироватьОтчетОбИспользованииЭСФССНаСервере(Настройки = Неопределено)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетОтчета");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));

	// Так как на форме настройки были взяты сразу из правильного варианта отчета, то мы их можем просто загрузить.
	ПеренестиПользовательскиеНастройкиОтборовВТекущиеНастройки(Объект.КомпоновщикНастроекОтбор);
	ОбновитьПараметрыДанныхНастройкиКомпоновщикаНастроек(Объект.КомпоновщикНастроекОтбор.Настройки.ПараметрыДанных.Элементы, Объект.КомпоновщикНастроекОтчет.Настройки.ПараметрыДанных.Элементы);
	СкопироватьОтборыНастройкиКомпоновщикаНастроек(Объект.КомпоновщикНастроекОтбор.Настройки.Отбор, Объект.КомпоновщикНастроекОтчет.Настройки.Отбор);

	КомпоновщикНастроек.ЗагрузитьНастройки(Объект.КомпоновщикНастроекОтчет.Настройки);
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,);
	
	МенеджерВременныхТаблиц = ЗагрузитьДанныеВМенеджерВременныхТаблиц();
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ,,,,МенеджерВременныхТаблиц);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ЗагрузитьДанныеВМенеджерВременныхТаблиц()
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Данные.ЧекСсылка КАК ЧекСсылка,
	               |	Данные.ИдентификаторКорзины КАК ИдентификаторКорзины,
	               |	Данные.НомерЭлектронногоСертификата КАК НомерЭлектронногоСертификата,
	               |	Данные.КодТРУ КАК КодТРУ,
	               |	Данные.КодНоменклатуры КАК КодНоменклатуры,
	               |	Данные.Количество КАК Количество,
	               |	Данные.Цена КАК Цена
	               |ПОМЕСТИТЬ ВтЗагруженныеДанныеПоЧекам
	               |ИЗ
	               |	&ЗагруженныеДанныеПоЧекам КАК Данные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.ЧекСсылка КАК ЧекСсылка,
	               |	Данные.ИдентификаторКорзины КАК ИдентификаторКорзины,
	               |	Данные.ОписаниеОшибки КАК ОписаниеОшибки
	               |ПОМЕСТИТЬ ВтНеЗагруженныеЧеки
	               |ИЗ
	               |	&НеЗагруженныеЧеки КАК Данные";
	
	Запрос.УстановитьПараметр("ЗагруженныеДанныеПоЧекам", Объект.ДанныеДляФормированияОтчета.Выгрузить());
	Запрос.УстановитьПараметр("НеЗагруженныеЧеки", Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Выгрузить());
	Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
КонецФункции

#КонецОбласти

#Область ПодготовкаДанныхДляЗагрузки

&НаКлиенте
Процедура ЗаполнитьЧекиДляЗагрузкиДанныхИзНСПКНаКлиенте(КомпоновщикНастроекСОтборами)
	
	ЗаполнитьЧекиДляЗагрузкиДанныхИзНСПКНаСервере(КомпоновщикНастроекСОтборами);
	УстановитьЗаголовокСтраницыРезультатаПроверки();
	УстановитьКонтекстнуюПодсказкуДляКнопкиПроверки(Элементы.КнопкаНайтиЧекиДляЗагрузкиДанныхИзНСПКРасширеннаяПодсказка.Заголовок, Ложь, Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество());	
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиПользовательскиеНастройкиОтборовВТекущиеНастройки(Источник)

	ОтборНастройки = Источник.Настройки.Отбор;
	ЭлементыПользовательскиеНастройки = Источник.ПользовательскиеНастройки.Элементы;

	Для Каждого ЭлементОтбораИсточник Из ЭлементыПользовательскиеНастройки Цикл
		ЭлементОтбораПриемника = Неопределено;
		
		Для каждого ЭлементОтбора Из ОтборНастройки.Элементы Цикл
			Если ЭлементОтбора.ИдентификаторПользовательскойНастройки = ЭлементОтбораИсточник.ИдентификаторПользовательскойНастройки Тогда
				ЭлементОтбораПриемника = ЭлементОтбора;
				ЭлементОтбораПриемника.Использование = ЭлементОтбораИсточник.Использование;
				ЭлементОтбораПриемника.ВидСравнения = ЭлементОтбораИсточник.ВидСравнения;
				ЭлементОтбораПриемника.ПравоеЗначение = ЭлементОтбораИсточник.ПравоеЗначение;
				Прервать;
		   КонецЕсли;	
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Возвращаемое значение:
//  Число - Количество найденных для загрузки чеков
//
Функция ЗаполнитьЧекиДляЗагрузкиДанныхИзНСПКНаСервере(КомпоновщикНастроекСОтборами)

	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетДанныеДляОбработки");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	// Так как на форме настройки были взяты сразу из правильного варианта отчета,
	// то мы их можем просто загрузить без какой-либо доп. обработки
	ПеренестиПользовательскиеНастройкиОтборовВТекущиеНастройки(КомпоновщикНастроекСОтборами);
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроекСОтборами.Настройки); 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Очистить();
	Если ТаблицаЗначений.Количество() Тогда
		Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Загрузить(ТаблицаЗначений);
	КонецЕсли;
	
	Возврат Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество();
КонецФункции

#КонецОбласти

#Область ЗагрузкаДанных

&НаКлиенте
Процедура ЗагрузитьДанныеИзНСПКНаКлиенте()
	
	Если Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'По установленным отборам не найдено чеков для загрузки данных из НСПК.'"));
		Возврат;
	КонецЕсли;

	Объект.ДанныеДляФормированияОтчета.Очистить();
	
	// Инициализация загрузки
	Элементы.ГруппаОсновнаяСтраница.ТолькоПросмотр = Истина;
	Элементы.ГруппаРезультатыПроверки.ТолькоПросмотр = Истина;	
	
	ПрерватьВыполнениеЗагрузки = Ложь;	
	Элементы.КнопкаПрерватьЗагрузкуДанныхИзНСПК.Доступность = Истина;	
	Элементы.ГруппаПраваяКолонкаОсновнойСтраницы.Доступность = Ложь;
	Элементы.ГруппаНастройкаОтправкиПакетовЗапросов.Доступность = Ложь;
	
	КоличествоЧековКОбработке = Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество();
	КоличествоОбработанныхЧеков = 0;
	ПроцентВыполненияЗагрузки = 0;
	СмещениеИндексаОбработки = 0;
	
	ПараметрыОперацииНСПК = ОбщиеПараметрыОперацииНСПКНаСервере(Объект.Организация);

	ПодключитьОбработчикОжидания("ВыполнитьПакетЗапросовКСервисуНСПК", 0.1, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбщиеПараметрыОперацииНСПКНаСервере(Организация)
	
	ОбщиеПараметрыПодключенияНСПК = ЭлектронныеСертификатыНСПКУТ.ОбщиеПараметрыПодключенияНСПК();
	ПараметрыПодключенияОрганизацииНСПК = ЭлектронныеСертификатыНСПКУТ.ПараметрыПодключенияОрганизацииНСПК(Организация);
		
	ПараметрыОперации = ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыОперацииНСПК();
	ПараметрыОперации.АдресСервера = ОбщиеПараметрыПодключенияНСПК.АдресСервисаНСПК;
	ПараметрыОперации.КлючДоступа = 
		?(ЗначениеЗаполнено(ПараметрыПодключенияОрганизацииНСПК.КлючОрганизацииНСПК),
			ПараметрыПодключенияОрганизацииНСПК.КлючОрганизацииНСПК,
			ОбщиеПараметрыПодключенияНСПК.КлючДоступаНСПК);

	ПараметрыОперации.ИнтернетПрокси.Сервер = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Сервер;
	ПараметрыОперации.ИнтернетПрокси.Порт = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Порт;
	ПараметрыОперации.ИнтернетПрокси.Пользователь = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Пользователь;
	ПараметрыОперации.ИнтернетПрокси.Пароль = ОбщиеПараметрыПодключенияНСПК.ПараметрыПроксиНСПК.Пароль;
	
	// Используем ВерсиюV2
	ПараметрыОперации.ПротоколОбмена = Перечисления.ПротоколОбменаФЭСНСПК.ВерсияV2;

	ПараметрыОперации.ПроверятьКорневыеСертификаты = ПолучитьФункциональнуюОпцию("ИспользоватьКорневыеСертификатыНСПК");

	Если ПараметрыОперации.СсылкаНаПлатежныйСчет = Неопределено Тогда
		ПараметрыОперации.СсылкаНаПлатежныйСчет = "";
	КонецЕсли;
	
	Возврат ПараметрыОперации;

КонецФункции

&НаКлиенте
Процедура ВыполнитьПакетЗапросовКСервисуНСПК()
	
	ОтключитьОбработчикОжидания("ВыполнитьПакетЗапросовКСервисуНСПК");
	
	// Установим переменные параметры операции
	ОбрабатываемаяСтрока = Объект.ЧекиДляЗагрузкиДанныхИзНСПК[СмещениеИндексаОбработки];
	
	ПараметрыОперацииНСПК.ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	ПараметрыОперацииНСПК.ИдентификаторКорзины = ОбрабатываемаяСтрока.ИдентификаторКорзины;
	ПараметрыОперацииНСПК.ИдентификаторКассы = ОбрабатываемаяСтрока.ИдентификаторКассы;
	ПараметрыОперацииНСПК.КлючКассы = ОбрабатываемаяСтрока.КлючКассы;
	
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("НачатьПолучениеСоставаКорзиныЗавершение", ЭтотОбъект);
	ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеСоставаКорзины(ОписаниеОповещенияЗавершения, ПараметрыОперацииНСПК);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСоставаКорзиныЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ТекстОписанияОшибки = "";
	ДанныеОбработаны = Истина;
	ОбрабатываемаяСтрока = Объект.ЧекиДляЗагрузкиДанныхИзНСПК[СмещениеИндексаОбработки];

	Если РезультатВыполнения.Результат Тогда
	// Сохраним данные для последующей обработки
		Если РезультатВыполнения.Свойство("ТоварныеПозиции") Тогда
			
			ОбщиеПоляНовойСтроки = Новый Структура;
			ОбщиеПоляНовойСтроки.Вставить("ЧекСсылка");
			ОбщиеПоляНовойСтроки.Вставить("ИдентификаторКорзины");
			ОбщиеПоляНовойСтроки.Вставить("КодТРУ");
			ОбщиеПоляНовойСтроки.Вставить("КодНоменклатуры");
			
			СтрокиТоварныхПозиций = Новый Массив;
			Для Каждого ТоварнаяПозиция Из РезультатВыполнения.ТоварныеПозиции Цикл
				ОбщиеПоляНовойСтроки.ЧекСсылка = ОбрабатываемаяСтрока.ЧекСсылка;
				ОбщиеПоляНовойСтроки.ИдентификаторКорзины = ОбрабатываемаяСтрока.ИдентификаторКорзины;
				ОбщиеПоляНовойСтроки.КодТРУ = ТоварнаяПозиция.КодТовараТРУ;
				ОбщиеПоляНовойСтроки.КодНоменклатуры = ТоварнаяПозиция.Артикул;
				
				Если ТоварнаяПозиция.Свойство("Сертификаты") Тогда
					Для Каждого Сертификат Из ТоварнаяПозиция.Сертификаты Цикл
						НоваяСтрока = Объект.ДанныеДляФормированияОтчета.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбщиеПоляНовойСтроки);
						НоваяСтрока.НомерЭлектронногоСертификата = Сертификат.Идентификатор;
						НоваяСтрока.Количество = Сертификат.Количество;
						НоваяСтрока.Цена = Сертификат.Цена;						
						СтрокиТоварныхПозиций.Добавить(НоваяСтрока);
					КонецЦикла;
				Иначе
					ДанныеОбработаны = Ложь;
					МассивШаблонаОписанияОшибки = Новый Массив;
					МассивШаблонаОписанияОшибки.Добавить("При получении состава корзины %1 из сервиса НСПК произошла ошибка:");
					МассивШаблонаОписанияОшибки.Добавить("Элемент массива ТоварныеПозиции с кодом ТРУ %2 не содержит свойство ""Сертификаты"".");
					
					ШаблонОписанияОшибки = СтрСоединить(МассивШаблонаОписанияОшибки, Символы.ПС);
					ТекстОписанияОшибки = СтрШаблон(ШаблонОписанияОшибки, 
													ОбрабатываемаяСтрока.ИдентификаторКорзины,
													ОбщиеПоляНовойСтроки.КодТРУ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ДанныеОбработаны И СтрокиТоварныхПозиций.Количество() = 0 Тогда

				ДанныеОбработаны = Ложь;
				МассивШаблонаОписанияОшибки = Новый Массив;
				МассивШаблонаОписанияОшибки.Добавить("При получении состава корзины %1 из сервиса НСПК произошла ошибка:");
				МассивШаблонаОписанияОшибки.Добавить("Не найдены данные о товарных позициях корзины.");
				
				ШаблонОписанияОшибки = СтрСоединить(МассивШаблонаОписанияОшибки, Символы.ПС);
				ТекстОписанияОшибки = СтрШаблон(ШаблонОписанияОшибки, 
												ОбрабатываемаяСтрока.ИдентификаторКорзины);
				
			ИначеЕсли Не ДанныеОбработаны И СтрокиТоварныхПозиций.Количество() = 0 Тогда
				
			ИначеЕсли ДанныеОбработаны И СтрокиТоварныхПозиций.Количество() > 0 Тогда
				
			ИначеЕсли Не ДанныеОбработаны И СтрокиТоварныхПозиций.Количество() > 0 Тогда
				Для Каждого СтрокаТоварныхПозиций Из СтрокиТоварныхПозиций Цикл
					Объект.ДанныеДляФормированияОтчета.Удалить(СтрокаТоварныхПозиций);
				КонецЦикла;
			КонецЕсли;
		Иначе
			
			ДанныеОбработаны = Ложь;
			МассивШаблонаОписанияОшибки = Новый Массив;
			МассивШаблонаОписанияОшибки.Добавить("При получении состава корзины %1 из сервиса НСПК произошла ошибка:");
			МассивШаблонаОписанияОшибки.Добавить("Результат выполнения не содержит свойство ""ТоварныеПозиции"".");
			
			ШаблонОписанияОшибки = СтрСоединить(МассивШаблонаОписанияОшибки, Символы.ПС);
			ТекстОписанияОшибки = СтрШаблон(ШаблонОписанияОшибки, 
											ОбрабатываемаяСтрока.ИдентификаторКорзины);
			
		КонецЕсли;
		
		Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Удалить(СмещениеИндексаОбработки);
	Иначе
		ДанныеОбработаны = Ложь;
		
		МассивШаблонаОписанияОшибки = Новый Массив;
		МассивШаблонаОписанияОшибки.Добавить("При получении состава корзины %1 из сервиса НСПК произошла ошибка:");
		МассивШаблонаОписанияОшибки.Добавить("Код: %2");
		МассивШаблонаОписанияОшибки.Добавить("Описание: %3");
		
		ШаблонОписанияОшибки = СтрСоединить(МассивШаблонаОписанияОшибки, Символы.ПС);
		ТекстОписанияОшибки = СтрШаблон(ШаблонОписанияОшибки, 
										ОбрабатываемаяСтрока.ИдентификаторКорзины,
										РезультатВыполнения.КодРезультата,
										РезультатВыполнения.ОписаниеОшибки);
	КонецЕсли;

	Если Не ДанныеОбработаны Тогда
		ОбрабатываемаяСтрока.ОписаниеОшибки = ТекстОписанияОшибки;
		РозничныеПродажиВызовСервера.ЗаписьЖурналаУровеньОшибка(
					"ЗагрузитьДанныеИзНСПК",
					,
					ОбрабатываемаяСтрока.ЧекСсылка,
					ТекстОписанияОшибки);

		Если Элементы.ВключитьРасширенныйРежим.Пометка = Ложь
			И Объект.ВыводитьСообщенияОбОшибкахЗагрузкиВОкноСообщений = Истина Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОписанияОшибки);
		КонецЕсли;
		
		СмещениеИндексаОбработки = СмещениеИндексаОбработки + 1;
		Если СмещениеИндексаОбработки >= Объект.ПредельноеЧислоОшибок Тогда
			// Нецелесообразно продолжать загрузку если ошибки возникают постоянно.
			ПрерватьВыполнениеЗагрузки = Истина;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоОбработанныхЧеков = КоличествоОбработанныхЧеков + 1;
	ПроцентВыполненияЗагрузки = Окр(КоличествоОбработанныхЧеков / КоличествоЧековКОбработке*100, 0, РежимОкругления.Окр15как20);
	
	Если ПрерватьВыполнениеЗагрузки Или КоличествоОбработанныхЧеков = КоличествоЧековКОбработке Тогда
		ОповещениеМетода = Новый ОписаниеОповещения("ЗагрузитьДанныеИзНСПКНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ВыполнитьОбработкуОповещения(ОповещениеМетода, Не ПрерватьВыполнениеЗагрузки);
	Иначе
		// Простая реализация неточной задержки
		ПримерноеВремяЗадержки = 0.1;
		Если Объект.ЗадержкаМеждуОтправкойПакетов > 100 Тогда
			ПримерноеВремяЗадержки = Окр(Объект.ЗадержкаМеждуОтправкойПакетов/1000,1);
		КонецЕсли;
		ПодключитьОбработчикОжидания("ВыполнитьПакетЗапросовКСервисуНСПК", ПримерноеВремяЗадержки, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзНСПКНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Элементы.ГруппаОсновнаяСтраница.ТолькоПросмотр = Ложь;
	Элементы.ГруппаРезультатыПроверки.ТолькоПросмотр = Ложь;
	
	Элементы.КнопкаПрерватьЗагрузкуДанныхИзНСПК.Доступность = Ложь;
	Элементы.ГруппаПраваяКолонкаОсновнойСтраницы.Доступность = Истина;
	Элементы.ГруппаНастройкаОтправкиПакетовЗапросов.Доступность = Истина;

	УстановитьЗаголовокСтраницыРезультатаПроверки();
	УстановитьКонтекстнуюПодсказкуДляКнопкиПроверки(Элементы.КнопкаНайтиЧекиДляЗагрузкиДанныхИзНСПКРасширеннаяПодсказка.Заголовок, Ложь, Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество());	

	Если ПрерватьВыполнениеЗагрузки Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выполнение загрузки прервано.'"));
	Иначе
		Если Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Данные загружены не по всем чекам.'"));
		КонецЕсли;	
		// Сформировать отчет после загрузки
		Если СформироватьОтчетПослеЗагрузкиДанных Тогда
			СформироватьОтчетОбИспользованииЭСФССНаКлиенте();
		Иначе
			//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Загрузка завершена.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ОбновитьПараметрыДанныхНастройкиКомпоновщикаНастроек(Источник, Приемник)
	
	Для Каждого ЭлементОтбораИсточник Из Источник Цикл	
		Для Каждого ЭлементОтбораПриемник Из Приемник Цикл
			Если ЭлементОтбораПриемник.Параметр = ЭлементОтбораИсточник.Параметр Тогда
				ЭлементОтбораПриемник.Значение = ЭлементОтбораИсточник.Значение;
				ЭлементОтбораПриемник.Использование = ЭлементОтбораИсточник.Использование;
				Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					ЭлементОтбораПриемник.ИдентификаторПользовательскойНастройки = ЭлементОтбораИсточник.ИдентификаторПользовательскойНастройки;
					ЭлементОтбораПриемник.ПредставлениеПользовательскойНастройки = ЭлементОтбораИсточник.ПредставлениеПользовательскойНастройки;
					ЭлементОтбораПриемник.РежимОтображения = ЭлементОтбораИсточник.РежимОтображения;
				КонецЕсли;
				ОбновитьПараметрыДанныхНастройкиКомпоновщикаНастроек(ЭлементОтбораИсточник.ЗначенияВложенныхПараметров, ЭлементОтбораПриемник.ЗначенияВложенныхПараметров);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура СкопироватьОтборыНастройкиКомпоновщикаНастроек(Источник, Приемник)
	
	Приемник.Элементы.Очистить();
	
	Для Каждого ЭлементОтбораИсточник Из Источник.Элементы Цикл
		
		ЭлементОтбораПриемника = Приемник.Элементы.Добавить(ТипЗнч(ЭлементОтбораИсточник));

		//ИдентификаторПользовательскойНастройки (UserSettingID)
		//ПредставлениеПользовательскойНастройки (UserSettingPresentation)
		//Использование (Use)
		//Представление (Presentation)
		//Применение (Application)
		//РежимОтображения (ViewMode)
		//Родитель (Parent)

		ЭлементОтбораПриемника.ИдентификаторПользовательскойНастройки = ЭлементОтбораИсточник.ИдентификаторПользовательскойНастройки;
		ЭлементОтбораПриемника.ПредставлениеПользовательскойНастройки = ЭлементОтбораИсточник.ПредставлениеПользовательскойНастройки;
		ЭлементОтбораПриемника.Использование = ЭлементОтбораИсточник.Использование;
		ЭлементОтбораПриемника.Представление = ЭлементОтбораИсточник.Представление;
		ЭлементОтбораПриемника.Применение = ЭлементОтбораИсточник.Применение;
		ЭлементОтбораПриемника.РежимОтображения = ЭлементОтбораИсточник.РежимОтображения;
		//ЭлементОтбораПриемника.Родитель = ЭлементОтбораИсточник.Родитель;

		Если ТипЗнч(ЭлементОтбораИсточник) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементОтбораПриемника.ВидСравнения = ЭлементОтбораИсточник.ВидСравнения;
			ЭлементОтбораПриемника.ЛевоеЗначение = ЭлементОтбораИсточник.ЛевоеЗначение;
			ЭлементОтбораПриемника.ПравоеЗначение = ЭлементОтбораИсточник.ПравоеЗначение;

			//ВидСравнения (ComparisonType)
			// ИдентификаторПользовательскойНастройки (UserSettingID)
			// Использование (Use)
			//ЛевоеЗначение (LeftValue)
			//ПравоеЗначение (RightValue)
			// Представление (Presentation)
			// ПредставлениеПользовательскойНастройки (UserSettingPresentation)
			// Применение (Application)
			// РежимОтображения (ViewMode)
			// Родитель (Parent)
			
		ИначеЕсли ТипЗнч(ЭлементОтбораИсточник) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
			ЭлементОтбораПриемника.ТипГруппы = ЭлементОтбораИсточник.ТипГруппы;
			 СкопироватьОтборыНастройкиКомпоновщикаНастроек(ЭлементОтбораИсточник, ЭлементОтбораПриемника);
			
			// ИдентификаторПользовательскойНастройки (UserSettingID)
			// Использование (Use)
			// Представление (Presentation)
			// ПредставлениеПользовательскойНастройки (UserSettingPresentation)
			// Применение (Application)
			// РежимОтображения (ViewMode)
			// Родитель (Parent)
			//ТипГруппы (GroupType)
			//Элементы (Items)
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКонтекстнуюПодсказкуДляКнопкиПроверки(ТекстПодсказки, СброситьПодсказку = Истина, КоличествоЧековДляЗагрузки = 0)
	ТекстПодсказки = НСтр("ru = 'Перед формированием отчета рекомендуется выполнить проверку состояния загрузки данных из НСПК за выбранный период.'");
	Если СброситьПодсказку = Ложь Тогда
		ТекстПодсказки = НСтр("ru = 'Успешно: Загрузка данных за указанный период не требуется.'");
		Если КоличествоЧековДляЗагрузки > 0 Тогда
			ТекстПодсказкиШаблон = НСтр("ru = 'Найдено %1 чеков, по которым нужно загрузить данные из НСПК.'");
			ТекстПодсказки = СтрШаблон(ТекстПодсказкиШаблон, Строка(КоличествоЧековДляЗагрузки));
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыРезультатаПроверки()
	
	Элементы.ГруппаРезультатыПроверки.Заголовок = НСтр("ru = 'Чеки для загрузки'");
	Если Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество() Тогда
		ШаблонЗаголовка = Элементы.ГруппаРезультатыПроверки.Заголовок + "(%1)";
		Элементы.ГруппаРезультатыПроверки.Заголовок = СтрШаблон(ШаблонЗаголовка, Строка(Объект.ЧекиДляЗагрузкиДанныхИзНСПК.Количество()));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьРасширенныйРежимНаСервере()

	Если Элементы.ВключитьРасширенныйРежим.Пометка Тогда
		Элементы.ГруппаПодготовительныхДействий.Видимость = Истина;
		Элементы.ГруппаРезультатыПроверки.Видимость = Истина;
		Элементы.ГруппаНастройки.Видимость = Истина;
	Иначе
		Элементы.ГруппаПодготовительныхДействий.Видимость = Ложь;
		Элементы.ГруппаРезультатыПроверки.Видимость = Ложь;
		Элементы.ГруппаНастройки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
